      /IF DEFINED (AR_ARRR__)
      /EOF
      /ENDIF

      /DEFINE AR_ARRR__
      /INCLUDE ARPG_H,ARCTYPES

      //---------------------------------------------------------------*
      // constants
      //---------------------------------------------------------------*
       dcl-c STG_ARRAY_QUICKSORT  %paddr('ArrayListQuickSort');
       dcl-c STG_ARRAY_SHAKERSORT %paddr('ArrayListShakerSort');

      //---------------------------------------------------------------*
      // ArrayListNew
      //---------------------------------------------------------------*
       dcl-pr ArrayListNew int(10) extproc(*dclcase);
         CpyFrom int(10) value options(*nopass);
         IdxStr  int(10) value options(*nopass);
         IdxLen  int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListAdd
      //---------------------------------------------------------------*
       dcl-pr ArrayListAdd int(10) extproc(*dclcase);
         Array int(10) value;
         Data  pointer value options(*string);
         Size  int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListAddInt
      //---------------------------------------------------------------*
       dcl-pr ArrayListAddInt int(10) extproc(*dclcase);
         Array int(10) value;
         Data  int(20) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListAddAll
      //---------------------------------------------------------------*
       dcl-pr ArrayListAddAll int(10) extproc(*dclcase);
         Array    int(10) value;
         ArraySrc int(10) value;
         IndexStr int(10) value options(*nopass);
         IndexLen int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListInsert
      //---------------------------------------------------------------*
       dcl-pr ArrayListInsert int(10) extproc(*dclcase);
         Array int(10) value;
         Index int(10) value;
         Data  pointer value options(*string);
         Size  int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListInsertAll
      //---------------------------------------------------------------*
       dcl-pr ArrayListInsertAll int(10) extproc(*dclcase);
         Array    int(10) value;
         Index    int(10) value;
         ArraySrc int(10) value;
         IndexStr int(10) value options(*nopass);
         IndexLen int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListClear
      //---------------------------------------------------------------*
       dcl-pr ArrayListClear int(10) extproc(*dclcase);
         Array int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListGet
      //---------------------------------------------------------------*
       dcl-pr ArrayListGet pointer extproc(*dclcase);
         Array int(10) value;
         Index int(10) value;
         Size  int(10) options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListGetInt
      //---------------------------------------------------------------*
       dcl-pr ArrayListGetInt int(20) extproc(*dclcase);
         Array int(10) value;
         Index int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListGetString
      //---------------------------------------------------------------*
       dcl-pr ArrayListGetString varchar(65535) extproc(*dclcase);
         Array int(10) value;
         Index int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListSet
      //---------------------------------------------------------------*
       dcl-pr ArrayListSet int(10) extproc(*dclcase);
         Array int(10) value;
         Index int(10) value;
         Data  pointer value options(*string);
         Size  int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListSetInt
      //---------------------------------------------------------------*
       dcl-pr ArrayListSetInt int(10) extproc(*dclcase);
         Array int(10) value;
         Index int(10) value;
         Data  int(20) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListObjectSize
      //---------------------------------------------------------------*
       dcl-pr ArrayListObjectSize int(10) extproc(*dclcase);
         Array int(10) value;
         Index int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListIndexOf
      //---------------------------------------------------------------*
       dcl-pr ArrayListIndexOf int(10) extproc(*dclcase);
         Array int(10) value;
         Data  pointer value options(*string);
         Size  int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListLastIndexOf
      //---------------------------------------------------------------*
       dcl-pr ArrayListLastIndexOf int(10) extproc(*dclcase);
         Array int(10) value;
         Data  pointer value options(*string);
         Size  int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListContains
      //---------------------------------------------------------------*
       dcl-pr ArrayListContains ind extproc(*dclcase);
         Array int(10) value;
         Data  pointer value options(*string);
         Size  int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListIsEmpty
      //---------------------------------------------------------------*
       dcl-pr ArrayListIsEmpty ind extproc(*dclcase);
         Array int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListIsSorted
      //---------------------------------------------------------------*
       dcl-pr ArrayListIsSorted ind extproc(*dclcase);
         Array int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListRemove
      //---------------------------------------------------------------*
       dcl-pr ArrayListRemove int(10) extproc(*dclcase);
         Array int(10) value;
         Index int(10) value;
         Len   int(10) value options(*nopass);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListSize
      //---------------------------------------------------------------*
       dcl-pr ArrayListSize int(10) extproc(*dclcase);
         Array int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListFree
      //---------------------------------------------------------------*
       dcl-pr ArrayListFree int(10) extproc(*dclcase);
         Array int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListIsValid
      //---------------------------------------------------------------*
       dcl-pr ArrayListIsValid ind extproc(*dclcase);
         Array int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListSort
      //---------------------------------------------------------------*
       dcl-pr ArrayListSort int(10) extproc(*dclcase);
         Array    int(10) value;
         Sort     pointer(*proc) const options(*nopass:*omit);
         Compare  pointer(*proc) const options(*nopass:*omit);
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListShakerSort
      //---------------------------------------------------------------*
       dcl-pr ArrayListShakerSort int(10) extproc(*dclcase);
         Array    pointer value;
         Compare  pointer(*proc) const;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListQuickSort
      //---------------------------------------------------------------*
       dcl-pr ArrayListQuickSort int(10) extproc(*dclcase);
         Array    pointer value;
         Compare  pointer(*proc) const;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListCompareAsc
      //---------------------------------------------------------------*
       dcl-pr ArrayListCompareAsc int(10) extproc(*dclcase);
         Data1 pointer value;
         Size1 int(10) value;
         Data2 pointer value;
         Size2 int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // ArrayListCompareDesc
      //---------------------------------------------------------------*
       dcl-pr ArrayListCompareDesc int(10) extproc(*dclcase);
         Data1 pointer value;
         Size1 int(10) value;
         Data2 pointer value;
         Size2 int(10) value;
       end-pr;
