**free
/IF NOT DEFINED (AR_CMDE__)

/DEFINE AR_CMDE__
/INCLUDE ARPG_H,ARCTYPES

//---------------------------------------------------------------*
// CmdExec
//---------------------------------------------------------------*
dcl-pr CmdExec int(10) extproc(*dclcase);
  command varchar(32702) value;
  options int(10) value options(*nopass);
end-pr;

/ENDIF
