**free
/IF NOT DEFINED (AR_SQLR__)

/DEFINE AR_SQLR__
/INCLUDE ARPG_H,ARCQSQPRC
/INCLUDE ARPG_H,ARCTYPES

//---------------------------------------------------------------*
//  constants
//---------------------------------------------------------------*
dcl-c SQL_CODE_EOF 100;
dcl-c SQL_CODE_ALREADY_EXISTS -601;

dcl-c SQL_TYPE_DATE 384;  
dcl-c SQL_TYPE_TIME 388;  
dcl-c SQL_TYPE_TIMESTAMP 392;  
dcl-c SQL_TYPE_DATALINK 396;  
dcl-c SQL_TYPE_NULL_GRAPHIC_STRING 400;  
dcl-c SQL_TYPE_BLOB 404;  
dcl-c SQL_TYPE_CLOB 408;  
dcl-c SQL_TYPE_DBCLOB 412;  
dcl-c SQL_TYPE_VARCHAR 448;  
dcl-c SQL_TYPE_CHAR 452;  
dcl-c SQL_TYPE_LONGVARCHAR 456;  
dcl-c SQL_TYPE_NULL_STRING 460;  
dcl-c SQL_TYPE_VARGRAPHIC 464;  
dcl-c SQL_TYPE_GRAPHIC 468;  
dcl-c SQL_TYPE_LONGVARGRAPHIC 472;  
dcl-c SQL_TYPE_PASCAL_L_STRING 476;  
dcl-c SQL_TYPE_FLOAT 480;  
dcl-c SQL_TYPE_PACKED 484;  
dcl-c SQL_TYPE_ZONED 488;  
dcl-c SQL_TYPE_BIGINT 492;  
dcl-c SQL_TYPE_INT 496;  
dcl-c SQL_TYPE_SMALLINT 500;  
dcl-c SQL_TYPE_DISPLAY_SIGN_LEADING_SEPARATE 504;  
dcl-c SQL_TYPE_ROWID 904;  
dcl-c SQL_TYPE_VARBINARY 908;  
dcl-c SQL_TYPE_BINARY 912;    
dcl-c SQL_TYPE_BLOB_FILE 916;  
dcl-c SQL_TYPE_CLOB_FILE 920;  
dcl-c SQL_TYPE_DBCLOB_FILE 924;  
dcl-c SQL_TYPE_BLOB_LOCATOR 960;  
dcl-c SQL_TYPE_CLOB_LOCATOR 964;  
dcl-c SQL_TYPE_DBCLOB_LOCATOR 968;  
dcl-c SQL_TYPE_RESULT_SET_LOCATOR 972;  
dcl-c SQL_TYPE_XML 988;  
dcl-c SQL_TYPE_DECFLOAT 996;  
dcl-c SQL_TYPE_XML_LOCATOR 2452;  
   
dcl-c SQL_DEFAULT_XML_SIZE 1024; // todo  
   
//---------------------------------------------------------------*
//  typedefs
//---------------------------------------------------------------*
dcl-s sqlstmvar_t varchar(32765) template;
dcl-s sqlstm_t char(32765) template;

//---------------------------------------------------------------*
//  SqlConnection
//---------------------------------------------------------------*
dcl-pr SqlConnection int(10) extproc(*dclcase);
  pAnSystem varchar(64) const options(*nopass);
  pAnUser varchar(30) const options(*nopass);
  pAnPass varchar(128) const options(*nopass);
end-pr;
       
//---------------------------------------------------------------*
//  SqlConnectionIsActive
//---------------------------------------------------------------*
dcl-pr SqlConnectionIsActive ind extproc(*dclcase);
  pInConnection int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlConnectionUsePerformanceArea
//---------------------------------------------------------------*
dcl-pr SqlConnectionUsePerformanceArea int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pBoOn ind const;
end-pr;
       
//---------------------------------------------------------------*
//  SqlConnectionSetOpenWithHold
//---------------------------------------------------------------*
dcl-pr SqlConnectionSetOpenWithHold int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pBoOn ind const;
end-pr;
       
//---------------------------------------------------------------*
//  SqlConnectionSetStatementCcsid
//---------------------------------------------------------------*
dcl-pr SqlConnectionSetStatementCcsid int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pInCcsid int(10) const;
end-pr;
      
//---------------------------------------------------------------*
//  SqlConnectionAllowBlocking
//---------------------------------------------------------------*
dcl-pr SqlConnectionAllowBlocking int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pAnOption char(1) const;
end-pr;
      
//---------------------------------------------------------------*
//  SqlConnectionAllowCopyOfData
//---------------------------------------------------------------*
dcl-pr SqlConnectionAllowCopyOfData int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pAnOption char(1) const;
end-pr;

//---------------------------------------------------------------*
//  SqlConnectionSetCommitControl
//---------------------------------------------------------------*
dcl-pr SqlConnectionSetCommitControl int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pAnOption char(1) const;
end-pr;

//---------------------------------------------------------------*
//  SqlConnectionSetNamingOption
//---------------------------------------------------------------*
dcl-pr SqlConnectionSetNamingOption int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pBoSql ind const;
end-pr;

//---------------------------------------------------------------*
//  SqlConnectionSetSortSequence
//---------------------------------------------------------------*
dcl-pr SqlConnectionSetSortSequence int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pAnTable char(10) const;
  pAnLib   char(10) const options(*nopass:*omit);
end-pr;
       
//---------------------------------------------------------------*
//  SqlConnectionPrepareStatement
//---------------------------------------------------------------*
dcl-pr SqlConnectionPrepareStatement int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pAnSqlStm like(sqlstmvar_t) const;
  pAnStmName varchar(18) const options(*nopass:*omit);
end-pr;
       
//---------------------------------------------------------------*
//  SqlConnectionSetPackage
//---------------------------------------------------------------*
dcl-pr SqlConnectionSetPackage int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pAnPackage char(10) const;
  pAnPackageLib char(10) const options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlConnectionClose
//---------------------------------------------------------------*
dcl-pr SqlConnectionClose int(10) extproc(*dclcase);
  pInConnection int(10) const;
end-pr;
       
//---------------------------------------------------------------*
//  SqlConnectionExecuteQuery
//---------------------------------------------------------------*
dcl-pr SqlConnectionExecuteQuery int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pAnSqlStm like(sqlstmvar_t) const;
  pAnStmName varchar(18) const options(*nopass:*omit);
end-pr;
       
//---------------------------------------------------------------*
//  SqlConnectionExecuteUpdate
//---------------------------------------------------------------*
dcl-pr SqlConnectionExecuteUpdate int(10) extproc(*dclcase);
  pInConnection int(10) const;
  pAnSqlStm like(sqlstmvar_t) const;
  pAnStmName varchar(18) const options(*nopass:*omit);
end-pr;
       
//---------------------------------------------------------------*
//  SqlConnectionCreateBlob
//---------------------------------------------------------------*
dcl-pr SqlConnectionCreateBlob int(10) extproc(*dclcase);
  pInConnection int(10) const;
end-pr;      

//---------------------------------------------------------------*
//  SqlConnectionCreateClob
//---------------------------------------------------------------*
dcl-pr SqlConnectionCreateClob int(10) extproc(*dclcase);
  pInConnection int(10) const;
end-pr;      

//---------------------------------------------------------------*
//  SqlConnectionCreateDbClob
//---------------------------------------------------------------*
dcl-pr SqlConnectionCreateDbClob int(10) extproc(*dclcase);
  pInConnection int(10) const;
end-pr;      

//---------------------------------------------------------------*
//  SqlConnectionCreateSqlXml
//---------------------------------------------------------------*
dcl-pr SqlConnectionCreateSqlXml int(10) extproc(*dclcase);
  pInConnection int(10) const;
end-pr;      

//---------------------------------------------------------------*
//  SqlPreparedStatementNew - for internal use only
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementNew int(10) extproc(*dclcase);
  pDsSqPrcEd likeds(DsSqPrcEd_t) const;
  pAnSqlStm like(sqlstmvar_t) const;
  pAnStmName varchar(18) const;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetCursorScrollable
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetCursorScrollable int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pBoScrollable ind const;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementLobAsString
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementLobAsString int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pBoOn ind const;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementExecuteQuery
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementExecuteQuery int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementExecuteUpdate
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementExecuteUpdate int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementClearParameters
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementClearParameters int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetString
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetString int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pAnString varchar(32767) value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetStringUcs
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetStringUcs int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pAnString varucs2(16383) value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetDecimal
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetDecimal int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pNuDecimal packed(31:11) value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetDouble
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetDouble int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pDbDouble float(8) value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetDate
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetDate int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pDaDate date value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetTime
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetTime int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pTiTime time value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetTimeStamp
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetTimeStamp int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pTsTimeStamp timestamp value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetLong
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetLong int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pInLong int(20) value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetBlob
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetBlob int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pInBlob int(10) value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetClob
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetClob int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pInClob int(10) value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetDbClob
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetDbClob int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pInDbClob int(10) value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementSetSqlXml
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementSetSqlXml int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
  pInSqlXml int(10) value;
end-pr;

//---------------------------------------------------------------*
//  SqlPreparedStatementFree
//---------------------------------------------------------------*
dcl-pr SqlPreparedStatementFree int(10) extproc(*dclcase);
  pInPrepStm int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlResultSetNext                                                        
//---------------------------------------------------------------*   
dcl-pr SqlResultSetNext ind extproc(*dclcase);                              
  pInResultSet int(10) const;                                        
end-pr;                                                              
                                                                     
//---------------------------------------------------------------*   
//  SqlResultSetPrior                                                        
//---------------------------------------------------------------*   
dcl-pr SqlResultSetPrior ind extproc(*dclcase);                              
  pInResultSet int(10) const;                                        
end-pr;                                                              
                                                                     
//---------------------------------------------------------------*   
//  SqlResultSetAbsolut                                                        
//---------------------------------------------------------------*   
dcl-pr SqlResultSetAbsolut ind extproc(*dclcase);                              
  pInResultSet int(10) const; 
  pInRows int(10) const;                                       
end-pr;                                                              
                                                                     
//---------------------------------------------------------------*   
//  SqlResultSetRelative                                                        
//---------------------------------------------------------------*   
dcl-pr SqlResultSetRelative ind extproc(*dclcase);                              
  pInResultSet int(10) const; 
  pInRows int(10) const;                                       
end-pr;                                                              
                                                                     
//---------------------------------------------------------------*   
//  SqlResultSetRefreshRow                                                        
//---------------------------------------------------------------*   
dcl-pr SqlResultSetRefreshRow ind extproc(*dclcase);                              
  pInResultSet int(10) const; 
end-pr;                                                              
                                                                     
//---------------------------------------------------------------*   
//  SqlResultSetFirst                                                        
//---------------------------------------------------------------*   
dcl-pr SqlResultSetFirst ind extproc(*dclcase);                              
  pInResultSet int(10) const;                                        
end-pr;                                                              
                       
//---------------------------------------------------------------*   
//  SqlResultSetLast                                                        
//---------------------------------------------------------------*   
dcl-pr SqlResultSetLast ind extproc(*dclcase);                              
  pInResultSet int(10) const;                                        
end-pr;                                                              
                                                                     
//---------------------------------------------------------------*   
//  SqlResultSetBeforeFirst                                                        
//---------------------------------------------------------------*   
dcl-pr SqlResultSetBeforeFirst ind extproc(*dclcase);                              
  pInResultSet int(10) const;                                        
end-pr;                                                              
                                                                     
//---------------------------------------------------------------*   
//  SqlResultSetAfterLast                                                        
//---------------------------------------------------------------*   
dcl-pr SqlResultSetAfterLast ind extproc(*dclcase);                              
  pInResultSet int(10) const;                                        
end-pr;                                                              
                                                                     
                                                                     
//---------------------------------------------------------------*   
//  SqlResultSetClose                                                       
//---------------------------------------------------------------*   
dcl-pr SqlResultSetClose int(10) extproc(*dclcase);                         
  pInResultSet int(10) const;                                        
end-pr;                                                              


//---------------------------------------------------------------*
//  SqlResultSetGetString
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetString varchar(32767) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;
       
//---------------------------------------------------------------*
//  SqlResultSetGetStringUcs
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetStringUcs varucs2(16383) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;
       
//---------------------------------------------------------------*
//  SqlResultSetGetDecimal
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetDecimal packed(31:11) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;
       
//---------------------------------------------------------------*
//  SqlResultSetGetDouble
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetDouble float(8) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetDate
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetDate date extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetTime
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetTime time extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetTimeStamp
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetTimeStamp timestamp extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetLong
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetLong int(20) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetHex
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetHex varchar(32767) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetIsNull
//---------------------------------------------------------------*
dcl-pr SqlResultSetIsNull ind extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetHasError
//---------------------------------------------------------------*
dcl-pr SqlResultSetHasError ind extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetFindColumn
//---------------------------------------------------------------*
dcl-pr SqlResultSetFindColumn int(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pAnColName varchar(256) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetColumnCount
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetColumnCount int(10) extproc(*dclcase);
  pInResultSet int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetColumnName
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetColumnName varchar(256) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetSysColumnName
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetSysColumnName varchar(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetLongColumnName
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetLongColumnName varchar(256) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetColumnPrefix
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetColumnPrefix char(1) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetColumnType
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetColumnType int(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetPrecision
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetPrecision int(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetScale
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetScale int(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetBlob
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetBlob int(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetClob
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetClob int(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetDbClob
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetDbClob int(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*
//  SqlResultSetGetSqlXml
//---------------------------------------------------------------*
dcl-pr SqlResultSetGetSqlXml int(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pInColIndex int(10) const;
  pBoNullId ind options(*nopass);
end-pr;

//---------------------------------------------------------------*   
//  SqlResultSetNew - for internal use only !                                                       
//---------------------------------------------------------------*   
dcl-pr SqlResultSetNew int(10) extproc(*dclcase);
  pDsSqPrcEd likeds(DsSqPrcEd_t) const;
  pPtOpenDa pointer;
  pPtDescribeDa pointer;
  pBoLobAsString ind const; 
end-pr;

//---------------------------------------------------------------*   
//  SqlResultSetSetRelatedStatement - for internal use only !                                                       
//---------------------------------------------------------------*   
dcl-pr SqlResultSetSetRelatedStatement int(10) extproc(*dclcase);
  pInResultSet int(10) const;
  pInPrepStm int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlBlobNew - for internal use only !                                                       
//---------------------------------------------------------------*   
dcl-pr SqlBlobNew int(10) extproc(*dclcase);
  pDsSqPrcEd likeds(DsSqPrcEd_t) const;
  pInLobLocator uns(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlBlobFree
//---------------------------------------------------------------*   
dcl-pr SqlBlobFree int(10) extproc(*dclcase);
  pInBlob int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlBlobLength
//---------------------------------------------------------------*   
dcl-pr SqlBlobLength int(10) extproc(*dclcase);
  pInBlob int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlBlobGetBytes
//---------------------------------------------------------------*   
dcl-pr SqlBlobGetBytes varchar(32765) extproc(*dclcase);
  pInBlob int(10) const;
  pInPos  int(10) const;
  pInlength int(5) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlBlobPosition
//---------------------------------------------------------------*   
dcl-pr SqlBlobPosition int(10) extproc(*dclcase);
  pInBlob int(10) const;
  pAnSearchstr varchar(32765) const;
  pInStart     int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlBlobWriteToFile
//---------------------------------------------------------------*   
dcl-pr SqlBlobWriteToFile int(10) extproc(*dclcase);
  pInBlob int(10) const;
  pAnFileName varchar(1024) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlBlobGetSqlLocator
//---------------------------------------------------------------*   
dcl-pr SqlBlobGetSqlLocator uns(10) extproc(*dclcase);
  pInBlob int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlClobNew - for internal use only !                                                       
//---------------------------------------------------------------*   
dcl-pr SqlClobNew int(10) extproc(*dclcase);
  pDsSqPrcEd likeds(DsSqPrcEd_t) const;
  pInLobLocator uns(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlClobFree
//---------------------------------------------------------------*   
dcl-pr SqlClobFree int(10) extproc(*dclcase);
  pInClob int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlClobLength
//---------------------------------------------------------------*   
dcl-pr SqlClobLength int(10) extproc(*dclcase);
  pInClob int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlClobGetSubstring
//---------------------------------------------------------------*   
dcl-pr SqlClobGetSubstring varchar(32765) extproc(*dclcase);
  pInClob int(10) const;
  pInPos  int(10) const;
  pInlength int(5) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlClobPosition
//---------------------------------------------------------------*   
dcl-pr SqlClobPosition int(10) extproc(*dclcase);
  pInClob int(10) const;
  pAnSearchstr varchar(32765) const;
  pInStart     int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlClobWriteToFile
//---------------------------------------------------------------*   
dcl-pr SqlClobWriteToFile int(10) extproc(*dclcase);
  pInClob int(10) const;
  pAnFileName varchar(1024) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlClobGetSqlLocator
//---------------------------------------------------------------*   
dcl-pr SqlClobGetSqlLocator uns(10) extproc(*dclcase);
  pInClob int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlDbClobNew - for internal use only !                                                       
//---------------------------------------------------------------*   
dcl-pr SqlDbClobNew int(10) extproc(*dclcase);
  pDsSqPrcEd likeds(DsSqPrcEd_t) const;
  pInLobLocator uns(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlDbClobFree
//---------------------------------------------------------------*   
dcl-pr SqlDbClobFree int(10) extproc(*dclcase);
  pInClob int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlDbClobLength
//---------------------------------------------------------------*   
dcl-pr SqlDbClobLength int(10) extproc(*dclcase);
  pInClob int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlDbClobGetSubstring
//---------------------------------------------------------------*   
dcl-pr SqlDbClobGetSubstring varchar(32765) extproc(*dclcase);
  pInClob int(10) const;
  pInPos  int(10) const;
  pInlength int(5) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlDbClobPosition
//---------------------------------------------------------------*   
dcl-pr SqlDbClobPosition int(10) extproc(*dclcase);
  pInDbClob int(10) const;
  pAnSearchstr varchar(32765) const;
  pInStart     int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlDbClobWriteToFile
//---------------------------------------------------------------*   
dcl-pr SqlDbClobWriteToFile int(10) extproc(*dclcase);
  pInDbClob int(10) const;
  pAnFileName varchar(1024) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlDbClobGetSqlLocator
//---------------------------------------------------------------*   
dcl-pr SqlDbClobGetSqlLocator uns(10) extproc(*dclcase);
  pInDbClob int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlSqlXmlNew - for internal use only !                                                       
//---------------------------------------------------------------*   
dcl-pr SqlSqlXmlNew int(10) extproc(*dclcase);
  pDsSqPrcEd likeds(DsSqPrcEd_t) const;
  pInLobLocator uns(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlSqlXmlFree
//---------------------------------------------------------------*   
dcl-pr SqlSqlXmlFree int(10) extproc(*dclcase);
  pInXml int(10) const;
end-pr;

//---------------------------------------------------------------*   
//  SqlSqlXmlGetSqlLocator
//---------------------------------------------------------------*   
dcl-pr SqlSqlXmlGetSqlLocator uns(10) extproc(*dclcase);
  pInDbClob int(10) const;
end-pr;

/ENDIF