      /IF NOT DEFINED (AR_STDLIB__)

      /DEFINE AR_STDLIB__
      /INCLUDE ARPG_H,ARCTYPES

      //---------------------------------------------------------------*
      // rand
      //---------------------------------------------------------------*
       dcl-pr rand int(10) extproc(*dclcase);
       end-pr;

      //---------------------------------------------------------------*
      // exit
      //---------------------------------------------------------------*
       dcl-pr exit extproc(*dclcase);
         status int(10) value;
       end-pr;

      //---------------------------------------------------------------*
      // putenv
      //---------------------------------------------------------------*
       dcl-pr putenv extproc(*dclcase);
         string pointer value options(*string);
       end-pr;

      //---------------------------------------------------------------*
      // getenv
      //---------------------------------------------------------------*
       dcl-pr getenv pointer extproc(*dclcase);
         string pointer value options(*string);
       end-pr;

      //---------------------------------------------------------------*
      // Qp0zInitEnv
      //---------------------------------------------------------------*
       dcl-pr Qp0zInitEnv extproc(*dclcase);
       end-pr;

      //---------------------------------------------------------------*
      // _C_TS_malloc
      //---------------------------------------------------------------*
       dcl-pr C_TS_malloc pointer extproc('_C_TS_malloc');
         size like(size_t) value;
       end-pr;

      //---------------------------------------------------------------*
      // _C_TS_realloc
      //---------------------------------------------------------------*
       dcl-pr C_TS_realloc pointer extproc('_C_TS_realloc');
         ptr pointer value;
         size like(size_t) value;
       end-pr;

      //---------------------------------------------------------------*
      // _C_TS_free
      //---------------------------------------------------------------*
       dcl-pr C_TS_free extproc('_C_TS_free');
         ptr pointer value;
       end-pr;
      /ENDIF
