**Free
ctl-opt nomain;
ctl-opt ccsid(*ucs2:13488);
/COPY ARPG_H,ARCALLCTL
//---------------------------------------------------------------*
// includes
//---------------------------------------------------------------*
/COPY ARPG_H,ARCSYSR
/COPY ARPG_H,ARCSQLR
/COPY ARPG_H,ARCOORR
/COPY ARPG_H,ARCSYSR
/COPY ARPG_H,ARCFCNTL

//---------------------------------------------------------------*
// typedefs
//---------------------------------------------------------------*

//---------------------------------------------------------------*
// constants
//---------------------------------------------------------------*

//---------------------------------------------------------------*
// global
//---------------------------------------------------------------*

//---------------------------------------------------------------*
//  SqlDbClobNew - protected
//---------------------------------------------------------------*
//* Creates a SQL resource locator.  
//*
//* @return SQL resource locator
//*
//* @diag messageCode to be defined
//*
//* @Author S.Allbach
//---------------------------------------------------------------*
dcl-proc SqlDbClobNew export;
  dcl-pi *N int(10);
    pDsSqPrcEd likeds(DsSqPrcEd_t) const;
    pInSqlLoc uns(10) const;
  end-pi;

  
  return 0;      
       
end-proc SqlDbClobNew;
//---------------------------------------------------------------*
//  SqlDbClobFree 
//---------------------------------------------------------------*
//* This method frees the DbClob object and releases the resources that it holds.  
//*
//* @return 0
//*
//* @diag messageCode to be defined
//*
//* @Author S.Allbach
//---------------------------------------------------------------*
dcl-proc SqlDbClobFree export;
  dcl-pi *N int(10);
    pInBlob int(10) const;
  end-pi;

  ///dcl-s bloblocator sqltype(blob_locator);
  ///exec sql free locator :bloblocator;
  
  return 0;      
       
end-proc SqlDbClobFree;
